%以下程序是现代机器人学逆动力学方程的应用
%角度 角速度  角加速度
thetalist = [0;0;0;0;0;0];
dthetalist = [0;0;0;0;0;0];
ddthetalist = [0;0;0;0;0;0];
q = thetalist;
dq = dthetalist;
ddq = ddthetalist;
%初始位形时，末端位姿M相对于基坐标系
M = [1 0 0 -0.0261;
     0 1 0 -1.1863;  
     0 0 1 -0.6540; 
     0 0 0 1];
%相对基坐标系的螺旋轴
w1 = [0;0;1]; %沿关节轴正向的单位向量 相对于基坐标系
w2 = [0;-1;0];
w3 = [0;-1;0];
w4 = [-1;0;0];
w5 = [0;1;0];
w6 = [0;0;1];

%关节坐标系
q1 = [0;0;0] ; %qn是关节轴上任一点 坐标值在基坐标系中进行度量 为方便选择，q选为q1=T01 q2=T02 q3=T03 q4=T04 q5=T05 q6=T06的末端位置
q2 = [-0.1573;0.0653;0]  ;
q3 = [-0.2037;-0.5483;-0.0165] ;
q4 = [-0.1518;-0.7154;-0.3140] ;
q5 = [-0.1081;-0.6714;-0.6685] ;
q6 = [-0.0261;-1.1863;-0.6540] ;

v1 = -cross(w1,q1); %线速度
v2 = -cross(w2,q2);
v3 = -cross(w3,q3);
v4 = -cross(w4,q4);
v5 = -cross(w5,q5);
v6 = -cross(w6,q6);

S1 = [w1;v1];
S2 = [w2;v2];
S3 = [w3;v3];
S4 = [w4;v4];
S5 = [w5;v5];
S6 = [w6;v6];

R1 = [0 -w1(3) w1(2);w1(3) 0 -w1(1);-w1(2) w1(1) 0]; %转轴的反对称矩阵
R2 = [0 -w2(3) w2(2);w2(3) 0 -w2(1);-w2(2) w2(1) 0];
R3 = [0 -w3(3) w3(2);w3(3) 0 -w3(1);-w3(2) w3(1) 0];
R4 = [0 -w4(3) w4(2);w4(3) 0 -w4(1);-w4(2) w4(1) 0];
R5 = [0 -w5(3) w5(2);w5(3) 0 -w5(1);-w5(2) w5(1) 0];
R6 = [0 -w6(3) w6(2);w6(3) 0 -w6(1);-w6(2) w6(1) 0];

G1 = eye(3)*q(1) + (1-cos(q(1)))*R1 + (q(1)-sin(q(1)))*R1^2;  
G2 = eye(3)*q(2) + (1-cos(q(2)))*R2 + (q(2)-sin(q(2)))*R2^2;
G3 = eye(3)*q(3) + (1-cos(q(3)))*R3 + (q(3)-sin(q(3)))*R3^2;
G4 = eye(3)*q(4) + (1-cos(q(4)))*R4 + (q(4)-sin(q(4)))*R4^2;
G5 = eye(3)*q(5) + (1-cos(q(5)))*R5 + (q(5)-sin(q(5)))*R5^2;
G6 = eye(3)*q(6) + (1-cos(q(6)))*R6 + (q(6)-sin(q(6)))*R6^2;

Rot1 = eye(3) + sin(q(1))*R1 + (1-cos(q(1)))*R1^2;  %刚体转动的矩阵指数
Rot2 = eye(3) + sin(q(2))*R2 + (1-cos(q(2)))*R2^2; 
Rot3 = eye(3) + sin(q(3))*R3 + (1-cos(q(3)))*R3^2;
Rot4 = eye(3) + sin(q(4))*R4 + (1-cos(q(4)))*R4^2; 
Rot5 = eye(3) + sin(q(5))*R5 + (1-cos(q(5)))*R5^2;
Rot6 = eye(3) + sin(q(6))*R6 + (1-cos(q(6)))*R6^2; 

eS1 = [Rot1 G1*v1 ;0 0 0 1];%刚体运动的矩阵指数
eS2 = [Rot2 G2*v2 ;0 0 0 1];
eS3 = [Rot3 G3*v3 ;0 0 0 1];
eS4 = [Rot4 G4*v4 ;0 0 0 1];
eS5 = [Rot5 G5*v5 ;0 0 0 1];
eS6 = [Rot6 G6*v6 ;0 0 0 1];

T = eS1*eS2*eS3*eS4*eS5*eS6*M; %基于基坐标系的表示

%自变量的定义------------------------
%六个连杆的质量
m1 = 17.9513;
m2 = 3.5484;
m3 = 7.3201;
m4 = 3.8682;
m5 = 0.7287;
m6 = 1;
m=[m1;m2;m3;m4;m5;m6];
%各个连杆的转动惯量
J1 = [ 0.5354  0.0131  -0.2059;
       0.0131  0.7118   0.0404;
      -0.2059   0.0404  0.5010];
        
J2 = [0.5044  -0.0164  -0.0021;
    -0.0164, 0.0144  -0.0304;
    -0.0021, -0.0304  0.5091];
        
J3 = [0.2601, -0.1844  -0.0883;
    -0.1844, 0.2780  -0.0850;
    -0.0883, -0.0850  0.3979];
        
J4 = [0.1544  -0.0001  -0.0143;
    -0.0001  0.1527  -0.0051;
    -0.0143  -0.0051  0.0224];
        
J5 = [0.0055  0  0;
    0, 0.0040, -0.0015;
    0, -0.0015, 0.0028];
        
J6 = [0.0042  0  0;
        0  0.005  0;
        0  0  0.02];
zer = zeros(3,3);

%各个连杆的相对前一个关节坐标系的重心即质心
r1 = [0.0467; -0.0104; 0.1100];
r2 = [-0.0155; -0.2895; -0.0268];
r3 = [0.1366; 0.1311; 0.0806];
r4 = [0.0350; 0.0044; 0.1474];
r5 = [3.9663e-06; -0.0019; 0.0540];
r6 = [0; 0; 0.05];
% 变换矩阵组成的列表
M01 = [eye(3) r1;0 0 0 1];
M02 = [0 -1 0 -0.1573;0 0 -1 0.0635;1 0 0 0;0 0 0 1]+[zer r2 ;0 0 0 1];
M03 = [0 -1 0 -0.2037;0 0 -1 -0.5483;1 0 0 -0.0165;0 0 0 1]+[zer r3;0 0 0 1];
M04 = [0 0 -1 -0.1518;0 1 0 -0.7154;1 0 0 -0.314;0 0 0 1]+[zer r4;0 0 0 1];
M05 = [1 0 0 -0.1081;0 0 1 -0.6714;0 -1 0 -0.6685;0 0 0 1]+[zer r5;0 0 0 1];
M06 = [1 0 0 -0.0261;0 1 0 -1.1863;0 0 1 -0.6540;0 0 0 1]+[zer r6;0 0 0 1];
M07 = M06;
M1 = M01; %M01
M2 = pinv(M01)*M02; %M12
M3 = pinv(M02)*M03; %M23
M4 = pinv(M03)*M04; %M34
M5 = pinv(M04)*M05; %M45
M6 = pinv(M05)*M06; %M56
M7 = pinv(M06)*M07; %M67
Mlist = cat(3,M1,M2,M3,M4,M5,M6,M7);

% 连杆空间惯量矩阵组成的列表
Gs1 = [J1 zer;zer m1*eye(3)];
Gs2 = [J2 zer;zer m2*eye(3)];
Gs3 = [J3 zer;zer m3*eye(3)];
Gs4 = [J4 zer;zer m4*eye(3)];
Gs5 = [J5 zer;zer m5*eye(3)];
Gs6 = [J6 zer;zer m6*eye(3)];
Glist = cat(3,Gs1,Gs2,Gs3,Gs4,Gs5,Gs6);
% 在基坐标系中表示的关节旋量轴Si组成的列表
Slist = [S1 S2 S3 S4 S5 S6];
Ftip = [0;0;0;0;0;0];
g = [0; 0; -9.8];
taulist = InverseDynamics(thetalist,dthetalist,ddthetalist,g,Ftip,Mlist,Glist,Slist)












